<?php
    return [
        "area_get" => [
            "name" => "Заявление на предоставление земельного участка",
            "model" => App\Models\AreaGet::class,
            "edit_route" => "area_get_edit",

            'statuses' => [
                "Черновик",
                "Отправлен",
                "Подписан и отправлен",
                "В обработке",
                "Предоставлен ответ"
            ],

            'statuses_counter' => [
                "Черновик" => 0,
                "Отправлен" => 0,
                "Подписан и отправлен" => 0,
                "В обработке" => 0,
                "Предоставлен ответ" => 0
            ],

            'statuses_noedit' => [
                "Отправлен",
                "Подписан и отправлен",
            ]
        ],

        "tc" => [
            "name" => "Заявления на технологическое присоединение",
            "model" => App\Models\TechnicalConnects::class,
            "edit_route" => "technical_connect_edit",

            'statuses' => [
                "Черновик",
                "Отправлен",
                "Подписан и отправлен",
                "В обработке",
                "Предоставлен ответ"
            ],

            'statuses_counter' => [
                "Черновик" => 0,
                "Отправлен" => 0,
                "Подписан и отправлен" => 0,
                "В обработке" => 0,
                "Предоставлен ответ" => 0
            ],

            'statuses_noedit' => [
                "Отправлен",
                "Подписан и отправлен",
            ]
        ],

    ];
